import { MovieInfo } from "../types/movie-info.types";

export const MOVIE_DATA : MovieInfo[] = [ 
  {
    adult: false,
    backdrop_path: "../../assets/640b4fba16572439857264.webp",
    genre_ids: [
      878,
      12
    ],
    genres:['Драма', 'Кримінальний'],
    id: 653346,
    original_language: "en",
    original_title: "Втеча з Шоушенка",
    overview: "За сюжетом фільму молодого віце-президента великого банку Енді Дюфрейна (Тім Роббінс), звинувачують у вбивстві своєї дружини та коханця, якого він не робив. Проте вирок суворий: два довічні терміни в одній із найпохмуріших в'язниць Америки – Шоушенку. Але Енді, незважаючи на весь жах ситуації, намагається жити далі: він займається навчанням ув'язнених, допомагає охоронцям із податковими деклараціями, веде фінансові махінації для начальника в'язниці, заводить дружбу з афроамериканським злочинцем на прізвисько Ред (Морган Фрімен). Йому він і розповідає про втечу, яку планує з самого початку перебування у в'язниці. У нього в камері висить плакат фільму «Мільйон років до нашої ери» з Ракель Велч. А за ним – дірка у стіні, яку Енді довгі роки робив за допомогою підручних засобів.",
    popularity: 4703.624,
    poster_path: "/gKkl37BQuKTanygYQG1pyYgLVgf.jpg",
    full_release_date: "1994-09-23",
    release_year:"1994",
    title: "Втеча з Шоушенка",
    video: false,
    vote_average: 9.3,
    vote_count: 807
  },
  {
    adult: false,
    backdrop_path: "../../assets/640c810004d50606721636.webp",
    genre_ids: [
      10752,
      28,
    ],
    genres:['Драма', 'Кримінальний'],
    id: 929590,
    original_language: "en",
    overview: "Дія картини відбувається в Америці в 1945-1955 роках. У будинку мафіозного боса Віто Корлеоне (Марлон Брандо) свято - його дочка Конні (Таліа Шайр) виходить заміж за Карло Ріцці (Джіані Руссо). Серед запрошених гостей багато хто хоче побачитися з хрещеним батьком Корлеоне, знаючи, що в цей радісний момент він не може відмовити в жодному проханні. Разом з особистим юристом Томом Гагеном (Роберт Дюваль) Віто вислуховує своїх прохачів і ухвалює важливі рішення. До Віто Корлеоне приходить відомий співак Джонні Фонтейн (Аль Мартіно), який є одним із хрещених синів авторитета. Він просить хрещеного батька допомогти отримати роль у новому голлівудському фільмі. Кінопродюсер Джек Вольц (Джон Марлі) відмовляється дати роль співакові, але дон Віто вирішує зробити йому пропозицію, від якої неможливо відмовитися. До Каліфорнії вилітає Том Гаген, який намагається спершу вирішити проблему миром, однак Вольц непохитний. Тоді Том вирішує піти іншим шляхом - він підкидає в ліжко до норовливого продюсера відрубану голову його улюбленого племінного скакуна. Цей хід приносить результат моментально - Джонні Фонтейн отримує роль у фільмі. Сім/'я Корлеоне є однією з найвпливовіших в Америці. Численні зв'язки «хрещеного батька» Віто дають прикриття для роботи більшості сицилійських кланів на території Нового світу, що є гарантом зростання капіталу й авторитету Корлеоне. Цей стан речей не влаштовує його конкурентів, і вони вирішують оголосити впливовому клану війну. Вони намагаються вбити Віто Корлеоне, але все закінчується безпечним для життя пораненням, яке тимчасово виводить хрещеного батька з гри. У цей момент на перший план виходить один із синів Віто Майкл Корлеоне (Аль Пачіно), який має твердий намір перемогти в цій війні проти інших мафіозних кланів, хоч би чого воно коштувало.",
    original_title: "Хрещений батько",
    popularity: 2418.019,
    poster_path: "/sh7Rg8Er3tFcN9BpKIPOMvALgZd.jpg",
    full_release_date: "1972-03-14",
    release_year:"1972",
    title: "Хрещений батько",
    video: false,
    vote_average: 9.2,
    vote_count: 1296
  },
  {
    adult: false,
    backdrop_path: "../../assets/640b4fcea031a527937622.webp",
    genre_ids: [
      27,
      53,
      22
    ],
    genres:['Драма', 'Біографія','Комедія'],
    id: 719221,
    original_language: "fr",
    original_title: "Недоторканні / 1+1",
    overview: "Багатого власника шикарного паризького будинку Філіпа (Франсуа Клюзе) внаслідок нещасного випадку паралізувало нижче шиї, він пересувається в моторизованому інвалідному візку і потребує постійної турботи. Він самотній, його дружина померла молодою. Разом зі своєю асистенткою Магалі (Одрі Флеро) він проводить співбесіди з претендентами на роль опікуна. На одну із зустрічей приходить молодий сенегалець Дрісс (Омар Сай), який нещодавно звільнився з в'язниці, де він провів півроку за пограбування. Йому не потрібна ця робота, йому потрібний лише підпис на документі, який підтвердить, що він шукав роботу, і йому відмовили. Тоді він зможе продовжувати отримувати соціальну допомогу. У день співбесіди тітка виганяє його з дому, де їхня велика родина і так тісно. Наступного дня Дрісс з'являється в будинку Філіпа і дізнається, що його взяли на роботу з випробувальним терміном за один місяць.Дрісс переїжджає в особняк і вчиться доглядати за Філіпом. Разом вони ходять на прийоми, галереями і театрами, де Дрісс відкриває для себе зовсім новий світ. У свій день народження Філіп влаштовує у себе вдома концерт класичної музики, у відповідь Дрісс знайомить боса зі своєю улюбленою музикою. Несподівано для себе Дріс починає малювати, і Філіп продає одну з його картин своєму знайомому за 11 тисяч євро, видавши її за роботу молодого багатообіцяючого художника.",
    popularity: 1540.535,
    poster_path: "/gAEUXC37vl1SnM7PXsHTF23I2vq.jpg",
    full_release_date: "2011-11-02",
    release_year:"2011",
    title: "Недоторканні / 1+1",
    video: false,
    vote_average: 8.5,
    vote_count: 341
  },
  {
    adult: false,
    backdrop_path: "../../assets/6411a03aec420340727509.webp",
    genre_ids: [
      878,
      28,
      12,
      53
    ],
    genres:['Драма', 'Кримінальний', 'Фентезі'],
    id: 823464,
    original_language: "en",
    original_title: "Зелена миля",
    overview: "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own.",
    popularity: 1931.335,
    poster_path: "/z1p34vh7dEOnLDmyCrlUVLuoDzd.jpg",
    full_release_date: "1999-12-10",
    release_year: "1999",
    title: "Зелена миля",
    video: false,
    vote_average: 8.6,
    vote_count: 2519
  },
] 